{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "b2674c2c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import Neo4J Python Library\n",
    "\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "68915024",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Establish DB Connection to Neo4J\n",
    "\n",
    "bolt_uri = \"bolt://localhost:7687\"\n",
    "driver = GraphDatabase.driver(bolt_uri, auth=(\"neo4j\", \"123456\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "5db4b7f5",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import Pandas and Numpy Library\n",
    "\n",
    "import pandas as pd\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "7f454d76",
   "metadata": {},
   "outputs": [],
   "source": [
    "#DB Query For Trained Data (Virus - Child Of - Virus)\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(\"\"\"\n",
    "             MATCH (virus:Virus)-[:CHILD_OF]->(other:Virus)\n",
    "             RETURN id(virus) as node1, id(other) as node2, virus.label AS virus1, other.label AS virus2, 1 AS label\n",
    "             \"\"\")\n",
    "    train_existing_links = pd.DataFrame([dict(record) for record in result])\n",
    "\n",
    "    result = session.run(\"\"\"\n",
    "             MATCH (virus:Virus)\n",
    "             WHERE (virus)-[:CHILD_OF]-()\n",
    "             MATCH (virus)-[:CHILD_OF*2..3]-(other)\n",
    "             WHERE not((virus)-[:CHILD_OF]-(other))\n",
    "             RETURN id(virus) as node1, id(other) as node2, virus.label AS virus1, other.label AS virus2, 0 AS label\n",
    "             \"\"\")\n",
    "    train_missing_links = pd.DataFrame([dict(record) for record in result])\n",
    "    train_missing_links = train_missing_links.drop_duplicates()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "dd833249",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Negative examples: 4792\n",
      "Positive examples: 303\n"
     ]
    }
   ],
   "source": [
    "# Data Training Labeling - With Total Data Samples Count\n",
    "\n",
    "training_df = train_missing_links.append(train_existing_links, ignore_index=True)\n",
    "training_df['label'] = training_df['label'].astype('category')\n",
    "\n",
    "count_class_0, count_class_1 = training_df.label.value_counts()\n",
    "print(f\"Negative examples: {count_class_0}\")\n",
    "print(f\"Positive examples: {count_class_1}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "17f4e327",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Random downsampling:\n",
      "0    303\n",
      "1    303\n",
      "Name: label, dtype: int64\n"
     ]
    }
   ],
   "source": [
    "# Random Downslamping of Trained Data\n",
    "\n",
    "df_class_0 = training_df[training_df['label'] == 0]\n",
    "df_class_1 = training_df[training_df['label'] == 1]\n",
    "\n",
    "df_class_0_under = df_class_0.sample(count_class_1)\n",
    "df_train_under = pd.concat([df_class_0_under, df_class_1], axis=0)\n",
    "\n",
    "print('Random downsampling:')\n",
    "print(df_train_under.label.value_counts())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "2acbd074",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Negative examples: 4792\n",
      "Positive examples: 303\n",
      "Random downsampling:\n",
      "0    303\n",
      "1    303\n",
      "Name: label, dtype: int64\n"
     ]
    }
   ],
   "source": [
    "# Detailed Random Downsampling with Positive and Negative Examples Count\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(\"\"\"\n",
    "             MATCH (virus:Virus)-[:CHILD_OF]->(other:Virus)\n",
    "             RETURN id(virus) as node1, id(other) as node2, virus.label AS virus1, other.label AS virus2, 1 AS label\n",
    "             \"\"\")\n",
    "    test_existing_links = pd.DataFrame([dict(record) for record in result])\n",
    "\n",
    "    result = session.run(\"\"\"\n",
    "             MATCH (virus:Virus)\n",
    "             WHERE (virus)-[:CHILD_OF]-()\n",
    "             MATCH (virus)-[:CHILD_OF*2..3]-(other)\n",
    "             WHERE not((virus)-[:CHILD_OF]-(other))\n",
    "             RETURN id(virus) as node1, id(other) as node2, virus.label AS virus1, other.label AS virus2, 0 AS label\n",
    "             \"\"\")\n",
    "    test_missing_links = pd.DataFrame([dict(record) for record in result])\n",
    "    test_missing_links = test_missing_links.drop_duplicates()\n",
    "\n",
    "test_df = test_missing_links.append(test_existing_links, ignore_index=True)\n",
    "test_df['label'] = test_df['label'].astype('category')\n",
    "\n",
    "count_class_0, count_class_1 = test_df.label.value_counts()\n",
    "print(f\"Negative examples: {count_class_0}\")\n",
    "print(f\"Positive examples: {count_class_1}\")\n",
    "\n",
    "df_class_0 = test_df[test_df['label'] == 0]\n",
    "df_class_1 = test_df[test_df['label'] == 1]\n",
    "\n",
    "df_class_0_under = df_class_0.sample(count_class_1)\n",
    "df_test_under = pd.concat([df_class_0_under, df_class_1], axis=0)\n",
    "\n",
    "print('Random downsampling:')\n",
    "print(df_test_under.label.value_counts())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "f28b4a9c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>virus1</th>\n",
       "      <th>virus2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>572</th>\n",
       "      <td>39</td>\n",
       "      <td>112</td>\n",
       "      <td>Simarterivirinae</td>\n",
       "      <td>Heroarterivirinae</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3658</th>\n",
       "      <td>216</td>\n",
       "      <td>204</td>\n",
       "      <td>Rhinacovirus</td>\n",
       "      <td>Pedacovirus</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2403</th>\n",
       "      <td>142</td>\n",
       "      <td>255</td>\n",
       "      <td>Rousettus bat coronavirus HKU9</td>\n",
       "      <td>Embecovirus</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4456</th>\n",
       "      <td>260</td>\n",
       "      <td>191</td>\n",
       "      <td>Porcine torovirus</td>\n",
       "      <td>Coronaviridae</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1952</th>\n",
       "      <td>114</td>\n",
       "      <td>245</td>\n",
       "      <td>Mesoniviridae</td>\n",
       "      <td>Olifoviridae</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5090</th>\n",
       "      <td>279</td>\n",
       "      <td>27</td>\n",
       "      <td>Tipravirus</td>\n",
       "      <td>Okavirus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5091</th>\n",
       "      <td>280</td>\n",
       "      <td>72</td>\n",
       "      <td>Bovine torovirus</td>\n",
       "      <td>Torovirus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5092</th>\n",
       "      <td>280</td>\n",
       "      <td>100</td>\n",
       "      <td>Bovine torovirus</td>\n",
       "      <td>Renitovirus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5093</th>\n",
       "      <td>281</td>\n",
       "      <td>158</td>\n",
       "      <td>Abyssoviridae</td>\n",
       "      <td>Abnidovirineae</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5094</th>\n",
       "      <td>282</td>\n",
       "      <td>172</td>\n",
       "      <td>Merbecovirus</td>\n",
       "      <td>Betacoronavirus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>606 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      node1  node2                          virus1             virus2 label\n",
       "572      39    112                Simarterivirinae  Heroarterivirinae     0\n",
       "3658    216    204                    Rhinacovirus        Pedacovirus     0\n",
       "2403    142    255  Rousettus bat coronavirus HKU9        Embecovirus     0\n",
       "4456    260    191               Porcine torovirus      Coronaviridae     0\n",
       "1952    114    245                   Mesoniviridae       Olifoviridae     0\n",
       "...     ...    ...                             ...                ...   ...\n",
       "5090    279     27                      Tipravirus           Okavirus     1\n",
       "5091    280     72                Bovine torovirus          Torovirus     1\n",
       "5092    280    100                Bovine torovirus        Renitovirus     1\n",
       "5093    281    158                   Abyssoviridae     Abnidovirineae     1\n",
       "5094    282    172                    Merbecovirus    Betacoronavirus     1\n",
       "\n",
       "[606 rows x 5 columns]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Call Data Sample\n",
    "\n",
    "df_train_under"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "a73b30b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Path Finding Algorithms - CN,PA,TN\n",
    "\n",
    "def apply_graphy_features(data, rel_type):\n",
    "    query = \"\"\"\n",
    "    UNWIND $pairs AS pair\n",
    "    MATCH (p1) WHERE id(p1) = pair.node1\n",
    "    MATCH (p2) WHERE id(p2) = pair.node2\n",
    "    RETURN pair.node1 AS node1,\n",
    "           pair.node2 AS node2,\n",
    "           gds.alpha.linkprediction.commonNeighbors(p1, p2, {\n",
    "             relationshipQuery: $relType}) AS cn,\n",
    "           gds.alpha.linkprediction.preferentialAttachment(p1, p2, {\n",
    "             relationshipQuery: $relType}) AS pa,\n",
    "           gds.alpha.linkprediction.totalNeighbors(p1, p2, {\n",
    "             relationshipQuery: $relType}) AS tn\n",
    "    \"\"\"\n",
    "    pairs = [{\"node1\": node1, \"node2\": node2}  for node1,node2 in data[[\"node1\", \"node2\"]].values.tolist()]\n",
    "\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.run(query, {\"pairs\": pairs, \"relType\": rel_type})\n",
    "        features = pd.DataFrame([dict(record) for record in result])\n",
    "    return pd.merge(data, features, on = [\"node1\", \"node2\"])\n",
    "\n",
    "df_train_under = apply_graphy_features(df_train_under, \"CHILD_OF\")\n",
    "df_test_under = apply_graphy_features(df_test_under, \"NOT_CHILD_OF\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "348135dd",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Triangle Count Algorithms\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.triangleCount.write({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: 'trianglesTrain'\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.triangleCount.write({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: 'trianglesTest'\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "0522adb2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Local Clustering Coefficient Algorithms\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.localClusteringCoefficient.write({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: 'coefficientTrain'\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.localClusteringCoefficient.write({\n",
    "  nodeProjection: 'Author',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: 'coefficientTest'\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "6a32816c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Minimun and Maximum Value of Triangle Count and Coefficient Clustering Processing\n",
    "\n",
    "def apply_triangles_features(data, triangles_prop, coefficient_prop):\n",
    "    query = \"\"\"\n",
    "    UNWIND $pairs AS pair\n",
    "    MATCH (p1) WHERE id(p1) = pair.node1\n",
    "    MATCH (p2) WHERE id(p2) = pair.node2\n",
    "    RETURN pair.node1 AS node1,\n",
    "    pair.node2 AS node2,\n",
    "    apoc.coll.min([p1[$trianglesProp], p2[$trianglesProp]]) AS minTriangles,\n",
    "    apoc.coll.max([p1[$trianglesProp], p2[$trianglesProp]]) AS maxTriangles,\n",
    "    apoc.coll.min([p1[$coefficientProp], p2[$coefficientProp]]) AS minCoefficient,\n",
    "    apoc.coll.max([p1[$coefficientProp], p2[$coefficientProp]]) AS maxCoefficient\n",
    "    \"\"\"\n",
    "    pairs = [{\"node1\": node1, \"node2\": node2}  for node1,node2 in data[[\"node1\", \"node2\"]].values.tolist()]\n",
    "    params = {\n",
    "    \"pairs\": pairs,\n",
    "    \"trianglesProp\": triangles_prop,\n",
    "    \"coefficientProp\": coefficient_prop\n",
    "    }\n",
    "\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.run(query, params)\n",
    "        features = pd.DataFrame([dict(record) for record in result])\n",
    "\n",
    "    return pd.merge(data, features, on = [\"node1\", \"node2\"])\n",
    "\n",
    "df_train_under = apply_triangles_features(df_train_under, \"trianglesTrain\", \"coefficientTrain\")\n",
    "df_test_under = apply_triangles_features(df_test_under, \"trianglesTest\", \"coefficientTest\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "60f23890",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>virus1</th>\n",
       "      <th>virus2</th>\n",
       "      <th>label</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "      <th>minTriangles</th>\n",
       "      <th>maxTriangles</th>\n",
       "      <th>minCoefficient</th>\n",
       "      <th>maxCoefficient</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>284</th>\n",
       "      <td>144</td>\n",
       "      <td>97</td>\n",
       "      <td>Middle East respiratory syndrome coronavirus</td>\n",
       "      <td>Murine coronavirus</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>140</th>\n",
       "      <td>234</td>\n",
       "      <td>269</td>\n",
       "      <td>Alphacoronavirus 1</td>\n",
       "      <td>Sunacovirus</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>402</th>\n",
       "      <td>91</td>\n",
       "      <td>140</td>\n",
       "      <td>Gresnaviridae</td>\n",
       "      <td>Arnidovirineae</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>10.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>552</th>\n",
       "      <td>234</td>\n",
       "      <td>249</td>\n",
       "      <td>Alphacoronavirus 1</td>\n",
       "      <td>Tegacovirus</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>238</th>\n",
       "      <td>88</td>\n",
       "      <td>36</td>\n",
       "      <td>Mibartevirus</td>\n",
       "      <td>Variarterivirinae</td>\n",
       "      <td>0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>5.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     node1  node2                                        virus1  \\\n",
       "284    144     97  Middle East respiratory syndrome coronavirus   \n",
       "140    234    269                            Alphacoronavirus 1   \n",
       "402     91    140                                 Gresnaviridae   \n",
       "552    234    249                            Alphacoronavirus 1   \n",
       "238     88     36                                  Mibartevirus   \n",
       "\n",
       "                 virus2 label   cn    pa   tn  minTriangles  maxTriangles  \\\n",
       "284  Murine coronavirus     0  0.0   3.0  4.0             0             1   \n",
       "140         Sunacovirus     0  0.0   2.0  3.0             0             0   \n",
       "402      Arnidovirineae     1  0.0  10.0  7.0             0             1   \n",
       "552         Tegacovirus     1  0.0   3.0  4.0             0             0   \n",
       "238   Variarterivirinae     0  1.0   8.0  5.0             0             0   \n",
       "\n",
       "     minCoefficient  maxCoefficient  \n",
       "284             0.0        0.333333  \n",
       "140             0.0        0.000000  \n",
       "402             0.0        0.100000  \n",
       "552             0.0        0.000000  \n",
       "238             0.0        0.000000  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_train_under.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "6d797338",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Community Detection - Label Propagation\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.labelPropagation.write({\n",
    "  nodeProjection: \"Virus\",\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: \"partitionTrain\"\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.labelPropagation.write({\n",
    "  nodeProjection: \"Virus\",\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: \"partitionTest\"\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "8ad3ed42",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'properties_set': 277}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": [
       "{'properties_set': 277}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Community Detection - louvain\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.louvain.stream({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  includeIntermediateCommunities: true\n",
    "})\n",
    "YIELD nodeId, communityId, intermediateCommunityIds\n",
    "WITH gds.util.asNode(nodeId) AS node, intermediateCommunityIds[0] AS smallestCommunity\n",
    "SET node.louvainTrain = smallestCommunity;\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    display(session.run(query).consume().counters)\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.louvain.stream({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  includeIntermediateCommunities: true\n",
    "})\n",
    "YIELD nodeId, communityId, intermediateCommunityIds\n",
    "WITH gds.util.asNode(nodeId) AS node, intermediateCommunityIds[0] AS smallestCommunity\n",
    "SET node.louvainTest = smallestCommunity;\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    display(session.run(query).consume().counters)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "9cb1a973",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Community Detection - Same Community\n",
    "\n",
    "def apply_community_features(data, partition_prop, louvain_prop):\n",
    "    query = \"\"\"\n",
    "    UNWIND $pairs AS pair\n",
    "    MATCH (p1) WHERE id(p1) = pair.node1\n",
    "    MATCH (p2) WHERE id(p2) = pair.node2\n",
    "    RETURN pair.node1 AS node1,\n",
    "    pair.node2 AS node2,\n",
    "    gds.alpha.linkprediction.sameCommunity(p1, p2, $partitionProp) AS sp,\n",
    "    gds.alpha.linkprediction.sameCommunity(p1, p2, $louvainProp) AS sl\n",
    "    \"\"\"\n",
    "    pairs = [{\"node1\": node1, \"node2\": node2}  for node1,node2 in data[[\"node1\", \"node2\"]].values.tolist()]\n",
    "    params = {\n",
    "    \"pairs\": pairs,\n",
    "    \"partitionProp\": partition_prop,\n",
    "    \"louvainProp\": louvain_prop\n",
    "    }\n",
    "\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.run(query, params)\n",
    "        features = pd.DataFrame([dict(record) for record in result])\n",
    "\n",
    "    return pd.merge(data, features, on = [\"node1\", \"node2\"])\n",
    "\n",
    "df_train_under = apply_community_features(df_train_under, \"partitionTrain\", \"louvainTrain\")\n",
    "df_test_under = apply_community_features(df_test_under, \"partitionTest\", \"louvainTest\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "bc843b80",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>virus1</th>\n",
       "      <th>virus2</th>\n",
       "      <th>label</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "      <th>minTriangles</th>\n",
       "      <th>maxTriangles</th>\n",
       "      <th>minCoefficient</th>\n",
       "      <th>maxCoefficient</th>\n",
       "      <th>sp</th>\n",
       "      <th>sl</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>39</td>\n",
       "      <td>112</td>\n",
       "      <td>Simarterivirinae</td>\n",
       "      <td>Heroarterivirinae</td>\n",
       "      <td>0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>14.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>216</td>\n",
       "      <td>204</td>\n",
       "      <td>Rhinacovirus</td>\n",
       "      <td>Pedacovirus</td>\n",
       "      <td>0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>142</td>\n",
       "      <td>255</td>\n",
       "      <td>Rousettus bat coronavirus HKU9</td>\n",
       "      <td>Embecovirus</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.047619</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>260</td>\n",
       "      <td>191</td>\n",
       "      <td>Porcine torovirus</td>\n",
       "      <td>Coronaviridae</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>114</td>\n",
       "      <td>245</td>\n",
       "      <td>Mesoniviridae</td>\n",
       "      <td>Olifoviridae</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   node1  node2                          virus1             virus2 label   cn  \\\n",
       "0     39    112                Simarterivirinae  Heroarterivirinae     0  1.0   \n",
       "1    216    204                    Rhinacovirus        Pedacovirus     0  1.0   \n",
       "2    142    255  Rousettus bat coronavirus HKU9        Embecovirus     0  0.0   \n",
       "3    260    191               Porcine torovirus      Coronaviridae     0  0.0   \n",
       "4    114    245                   Mesoniviridae       Olifoviridae     0  0.0   \n",
       "\n",
       "     pa   tn  minTriangles  maxTriangles  minCoefficient  maxCoefficient   sp  \\\n",
       "0  14.0  8.0             0             0             0.0        0.000000  1.0   \n",
       "1   6.0  4.0             0             0             0.0        0.000000  0.0   \n",
       "2   7.0  8.0             0             1             0.0        0.047619  0.0   \n",
       "3   8.0  6.0             0             1             0.0        1.000000  0.0   \n",
       "4   8.0  6.0             0             2             0.0        0.333333  0.0   \n",
       "\n",
       "    sl  \n",
       "0  0.0  \n",
       "1  0.0  \n",
       "2  0.0  \n",
       "3  0.0  \n",
       "4  0.0  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_train_under.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "4dfef3c0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Machine Kearning Evaluation - Randoom Forest Classifier\n",
    "\n",
    "# # Global Variable Declaration\n",
    "# accuracy = float(0)\n",
    "# precision = float(0)\n",
    "# recall = float(0)\n",
    "\n",
    "# # Data Training Iteration - 10 Times\n",
    "# for i in range(10):\n",
    "#     temp_acc = 0\n",
    "#     temp_prec = 0\n",
    "#     temp_recall = 0\n",
    "    \n",
    "#     df_train_under.sample(10)\n",
    "\n",
    "#     from sklearn.ensemble import RandomForestClassifier\n",
    "#     classifier = RandomForestClassifier(n_estimators=30, max_depth=10, random_state=0)\n",
    "\n",
    "#     columns = [\n",
    "#         \"cn\", \"pa\", \"tn\", # graph features\n",
    "#         \"minTriangles\", \"maxTriangles\", \"minCoefficient\", \"maxCoefficient\", # triangle features\n",
    "#         \"sp\", \"sl\" # community features\n",
    "#     ]\n",
    "\n",
    "#     X = df_train_under[columns]\n",
    "#     y = df_train_under[\"label\"]\n",
    "#     classifier.fit(X, y)\n",
    "\n",
    "#     from sklearn.metrics import recall_score\n",
    "#     from sklearn.metrics import precision_score\n",
    "#     from sklearn.metrics import accuracy_score\n",
    "\n",
    "#     def evaluate_model(predictions, actual):\n",
    "#         temp_acc = float(accuracy_score(actual, predictions))\n",
    "#         temp_prec = float(precision_score(actual, predictions))\n",
    "#         temp_recall = float(recall_score(actual, predictions))\n",
    "        \n",
    "#         global accuracy\n",
    "#         global precision\n",
    "#         global recall\n",
    "\n",
    "#         accuracy += temp_acc\n",
    "#         precision += temp_prec\n",
    "#         recall += temp_recall\n",
    "        \n",
    "#         return pd.DataFrame({\n",
    "#             \"Measure\": [\"Accuracy\", \"Precision\", \"Recall\"],\n",
    "#             \"Score\": [accuracy_score(actual, predictions),\n",
    "#                       precision_score(actual, predictions),\n",
    "#                       recall_score(actual, predictions)]\n",
    "#         })\n",
    "    \n",
    "#     predictions = classifier.predict(df_train_under[columns])\n",
    "#     y_test = df_test_under[\"label\"]\n",
    "\n",
    "#     evaluate_model(predictions, y_test)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "70258268",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# # Model Evaluation Result - Cont'd\n",
    "\n",
    "# # Average of Evaluation Results\n",
    "# avg_accuracy = accuracy / 10\n",
    "# avg_precision = precision / 10\n",
    "# avg_recall = recall / 10\n",
    "\n",
    "# # Finalized Evaluation Result Data Frame\n",
    "# pd_final = pd.DataFrame({\n",
    "#     \"Measure\": [\"Accuracy\", \"Precision\", \"Recall\"],\n",
    "#     \"Score\": [avg_accuracy,avg_precision,avg_recall]\n",
    "# })\n",
    "\n",
    "# # Call Final Finalized Evaluation Result Data Frame\n",
    "# pd_final"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "fddcac75",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fold:1, Train set: 545, Test set:61\n",
      "Fold:2, Train set: 545, Test set:61\n",
      "Fold:3, Train set: 545, Test set:61\n",
      "Fold:4, Train set: 545, Test set:61\n",
      "Fold:5, Train set: 545, Test set:61\n",
      "Fold:6, Train set: 545, Test set:61\n",
      "Fold:7, Train set: 546, Test set:60\n",
      "Fold:8, Train set: 546, Test set:60\n",
      "Fold:9, Train set: 546, Test set:60\n",
      "Fold:10, Train set: 546, Test set:60\n"
     ]
    }
   ],
   "source": [
    "from sklearn.model_selection import KFold, StratifiedKFold, cross_val_score\n",
    "from sklearn import linear_model, tree, ensemble\n",
    "\n",
    "columns = [\n",
    "        \"cn\", \"pa\", \"tn\", # graph features\n",
    "        \"minTriangles\", \"maxTriangles\", \"minCoefficient\", \"maxCoefficient\", # triangle features\n",
    "        \"sp\", \"sl\" # community features\n",
    "    ]\n",
    "\n",
    "X = df_train_under[columns]\n",
    "y = df_train_under[\"label\"]\n",
    "\n",
    "kf =KFold(n_splits=10, shuffle=True, random_state=42)\n",
    "\n",
    "cnt = 1\n",
    "for train_index, test_index in kf.split(X, y):\n",
    "    print(f'Fold:{cnt}, Train set: {len(train_index)}, Test set:{len(test_index)}')\n",
    "    cnt += 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "c1abe6c9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Test Number</th>\n",
       "      <th>Accuracy</th>\n",
       "      <th>Precision</th>\n",
       "      <th>Recall</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>0.901639</td>\n",
       "      <td>0.870968</td>\n",
       "      <td>0.931034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>0.918033</td>\n",
       "      <td>0.846154</td>\n",
       "      <td>0.956522</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>0.950820</td>\n",
       "      <td>0.903226</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>0.868852</td>\n",
       "      <td>0.846154</td>\n",
       "      <td>0.942857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>0.852459</td>\n",
       "      <td>0.794118</td>\n",
       "      <td>0.931034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>6</td>\n",
       "      <td>0.901639</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.837838</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>7</td>\n",
       "      <td>0.883333</td>\n",
       "      <td>0.967742</td>\n",
       "      <td>0.833333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>8</td>\n",
       "      <td>0.950000</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.884615</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>9</td>\n",
       "      <td>0.916667</td>\n",
       "      <td>0.925926</td>\n",
       "      <td>0.892857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>10</td>\n",
       "      <td>0.916667</td>\n",
       "      <td>0.935484</td>\n",
       "      <td>0.906250</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Test Number  Accuracy  Precision    Recall\n",
       "0            1  0.901639   0.870968  0.931034\n",
       "1            2  0.918033   0.846154  0.956522\n",
       "2            3  0.950820   0.903226  1.000000\n",
       "3            4  0.868852   0.846154  0.942857\n",
       "4            5  0.852459   0.794118  0.931034\n",
       "5            6  0.901639   1.000000  0.837838\n",
       "6            7  0.883333   0.967742  0.833333\n",
       "7            8  0.950000   1.000000  0.884615\n",
       "8            9  0.916667   0.925926  0.892857\n",
       "9           10  0.916667   0.935484  0.906250"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from sklearn.model_selection import KFold, StratifiedKFold, cross_val_score\n",
    "from sklearn import linear_model, tree, ensemble\n",
    "\n",
    "columns = [\n",
    "        \"cn\", \"pa\", \"tn\", # graph features\n",
    "        \"minTriangles\", \"maxTriangles\", \"minCoefficient\", \"maxCoefficient\", # triangle features\n",
    "        \"sp\", \"sl\" # community features\n",
    "    ]\n",
    "\n",
    "X = df_train_under[columns]\n",
    "y = df_train_under[\"label\"]\n",
    "\n",
    "kf =KFold(n_splits=10, shuffle=True, random_state=42)\n",
    "\n",
    "cnt = 1\n",
    "for train_index, test_index in kf.split(X, y):\n",
    "    print(f'Fold:{cnt}, Train set: {len(train_index)}, Test set:{len(test_index)}')\n",
    "    cnt += 1\n",
    "\n",
    "accuracy = cross_val_score(ensemble.RandomForestClassifier(random_state= 42), X, y, cv= kf, scoring=\"accuracy\")\n",
    "\n",
    "precision = cross_val_score(ensemble.RandomForestClassifier(random_state= 42), X, y, cv= kf, scoring=\"precision\")\n",
    "\n",
    "recall = cross_val_score(ensemble.RandomForestClassifier(random_state= 42), X, y, cv= kf, scoring=\"recall\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "cf6584cb",
   "metadata": {},
   "outputs": [],
   "source": [
    "pd_final.to_csv(r'C:\\Users\\fikri\\Desktop\\pd_final.csv', index = False, header=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "2f3a3385",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Average Measure Result</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Accuracy</td>\n",
       "      <td>0.906011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Precision</td>\n",
       "      <td>0.908977</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Recall</td>\n",
       "      <td>0.911634</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Average Measure Result     Score\n",
       "0               Accuracy  0.906011\n",
       "1              Precision  0.908977\n",
       "2                 Recall  0.911634"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "avg_accuracy = 0;\n",
    "temp_acc = 0\n",
    "for i in accuracy:\n",
    "    global temp_acc\n",
    "    temp_acc+=i\n",
    "    global avg_accuracy\n",
    "    avg_accuracy = temp_acc / len(accuracy)\n",
    "    \n",
    "\n",
    "avg_precision = 0;\n",
    "temp_prec = 0\n",
    "for i in precision:\n",
    "    global temp_prec\n",
    "    temp_prec+=i\n",
    "    global avg_precision\n",
    "    avg_precision = temp_prec / len(precision)\n",
    "    \n",
    "\n",
    "avg_recall = 0;\n",
    "temp_recall = 0\n",
    "for i in recall:\n",
    "    global temp_recall\n",
    "    temp_recall+=i\n",
    "    global avg_recall\n",
    "    avg_recall = temp_recall / len(recall)\n",
    "    \n",
    "pd_final_average = pd.DataFrame({\n",
    "    \"Average Measure Result\": [\"Accuracy\", \"Precision\", \"Recall\"],\n",
    "    \"Score\": [avg_accuracy,avg_precision,avg_recall]\n",
    "})\n",
    "\n",
    "pd_final_average"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "311cd863",
   "metadata": {},
   "outputs": [],
   "source": [
    "pd_final_average.to_csv(r'C:\\Users\\fikri\\Desktop\\pd_final_avg.csv', index = False, header=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "6f5339b0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Model Evaluation Completed\n"
     ]
    }
   ],
   "source": [
    "print(\"Model Evaluation Completed\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "202a5918",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Export to CSV\n",
    "\n",
    "# df_train_under.to_csv(r'C:\\Users\\fikri\\Desktop\\dataset_FP.csv', index = False, header=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "62557290",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Nodes Visualization\n",
    "\n",
    "from pyvis.network import Network\n",
    "import pandas as pd\n",
    "\n",
    "covtax_net = Network(height='auto', width='100%', bgcolor='#222222', font_color='white')\n",
    "\n",
    "# set the physics layout of the network\n",
    "covtax_net.force_atlas_2based()\n",
    "covtax_data = pd.read_csv(r'C:\\Users\\fikri\\Desktop\\dataset_FP.csv')\n",
    "\n",
    "virus1 = covtax_data['virus1']\n",
    "virus2 = covtax_data['virus2']\n",
    "edge_data = zip(virus1, virus2)\n",
    "\n",
    "for e in edge_data:\n",
    "    vir1 = e[0]\n",
    "    vir2 = e[1]\n",
    "\n",
    "    covtax_net.add_node(vir1, vir1, title=vir1)\n",
    "    covtax_net.add_node(vir2, vir2, title=vir2)\n",
    "    covtax_net.add_edge(vir1, vir2)\n",
    "    \n",
    "# add neighbor data to node hover data\n",
    "for node in covtax_net.nodes:\n",
    "    node['title'] += ' Neighbors:<br><br>' + '<br>'.join(neighbor_map[node['id']])\n",
    "    node['value'] = len(neighbor_map[node['id']])\n",
    "\n",
    "covtax_net.show_buttons(filter_=['physics'])\n",
    "covtax_net.show('covid_taxonomy.html')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f71f4fa4",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
