{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "b2674c2c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import Neo4J Python Library\n",
    "\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "68915024",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Establish DB Connection to Neo4J\n",
    "\n",
    "bolt_uri = \"bolt://localhost:7687\"\n",
    "driver = GraphDatabase.driver(bolt_uri, auth=(\"neo4j\", \"123456\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "5db4b7f5",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import Pandas and Numpy Library\n",
    "\n",
    "import pandas as pd\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "7f454d76",
   "metadata": {},
   "outputs": [],
   "source": [
    "#DB Query For Trained Data (Virus - Child Of - Virus)\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(\"\"\"\n",
    "             MATCH (virus:Virus)-[:CHILD_OF]->(other:Virus)\n",
    "             RETURN id(virus) as node1, id(other) as node2, virus.label AS virus1, other.label AS virus2, 1 AS label\n",
    "             \"\"\")\n",
    "    train_existing_links = pd.DataFrame([dict(record) for record in result])\n",
    "\n",
    "    result = session.run(\"\"\"\n",
    "             MATCH (virus:Virus)\n",
    "             WHERE (virus)-[:CHILD_OF]-()\n",
    "             MATCH (virus)-[:CHILD_OF*2..3]-(other)\n",
    "             WHERE not((virus)-[:CHILD_OF]-(other))\n",
    "             RETURN id(virus) as node1, id(other) as node2, virus.label AS virus1, other.label AS virus2, 0 AS label\n",
    "             \"\"\")\n",
    "    train_missing_links = pd.DataFrame([dict(record) for record in result])\n",
    "    train_missing_links = train_missing_links.drop_duplicates()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "dd833249",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Negative examples: 4792\n",
      "Positive examples: 303\n"
     ]
    }
   ],
   "source": [
    "# Data Training Labeling - With Total Data Samples Count\n",
    "\n",
    "training_df = train_missing_links.append(train_existing_links, ignore_index=True)\n",
    "training_df['label'] = training_df['label'].astype('category')\n",
    "\n",
    "count_class_0, count_class_1 = training_df.label.value_counts()\n",
    "print(f\"Negative examples: {count_class_0}\")\n",
    "print(f\"Positive examples: {count_class_1}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "17f4e327",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Random downsampling:\n",
      "0    303\n",
      "1    303\n",
      "Name: label, dtype: int64\n"
     ]
    }
   ],
   "source": [
    "# Random Downslamping of Trained Data\n",
    "\n",
    "df_class_0 = training_df[training_df['label'] == 0]\n",
    "df_class_1 = training_df[training_df['label'] == 1]\n",
    "\n",
    "df_class_0_under = df_class_0.sample(count_class_1)\n",
    "df_train_under = pd.concat([df_class_0_under, df_class_1], axis=0)\n",
    "\n",
    "print('Random downsampling:')\n",
    "print(df_train_under.label.value_counts())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "2acbd074",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Negative examples: 4792\n",
      "Positive examples: 303\n",
      "Random downsampling:\n",
      "0    303\n",
      "1    303\n",
      "Name: label, dtype: int64\n"
     ]
    }
   ],
   "source": [
    "# Detailed Random Downsampling with Positive and Negative Examples Count\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(\"\"\"\n",
    "             MATCH (virus:Virus)-[:CHILD_OF]->(other:Virus)\n",
    "             RETURN id(virus) as node1, id(other) as node2, virus.label AS virus1, other.label AS virus2, 1 AS label\n",
    "             \"\"\")\n",
    "    test_existing_links = pd.DataFrame([dict(record) for record in result])\n",
    "\n",
    "    result = session.run(\"\"\"\n",
    "             MATCH (virus:Virus)\n",
    "             WHERE (virus)-[:CHILD_OF]-()\n",
    "             MATCH (virus)-[:CHILD_OF*2..3]-(other)\n",
    "             WHERE not((virus)-[:CHILD_OF]-(other))\n",
    "             RETURN id(virus) as node1, id(other) as node2, virus.label AS virus1, other.label AS virus2, 0 AS label\n",
    "             \"\"\")\n",
    "    test_missing_links = pd.DataFrame([dict(record) for record in result])\n",
    "    test_missing_links = test_missing_links.drop_duplicates()\n",
    "\n",
    "test_df = test_missing_links.append(test_existing_links, ignore_index=True)\n",
    "test_df['label'] = test_df['label'].astype('category')\n",
    "\n",
    "count_class_0, count_class_1 = test_df.label.value_counts()\n",
    "print(f\"Negative examples: {count_class_0}\")\n",
    "print(f\"Positive examples: {count_class_1}\")\n",
    "\n",
    "df_class_0 = test_df[test_df['label'] == 0]\n",
    "df_class_1 = test_df[test_df['label'] == 1]\n",
    "\n",
    "df_class_0_under = df_class_0.sample(count_class_1)\n",
    "df_test_under = pd.concat([df_class_0_under, df_class_1], axis=0)\n",
    "\n",
    "print('Random downsampling:')\n",
    "print(df_test_under.label.value_counts())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "f28b4a9c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>virus1</th>\n",
       "      <th>virus2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2670</th>\n",
       "      <td>158</td>\n",
       "      <td>112</td>\n",
       "      <td>Abnidovirineae</td>\n",
       "      <td>Heroarterivirinae</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1427</th>\n",
       "      <td>86</td>\n",
       "      <td>117</td>\n",
       "      <td>Peiartevirus</td>\n",
       "      <td>Kigiartevirus</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2328</th>\n",
       "      <td>139</td>\n",
       "      <td>272</td>\n",
       "      <td>BtKY72/Rhinolophus sp./Kenya/2007</td>\n",
       "      <td>Hibecovirus</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2900</th>\n",
       "      <td>172</td>\n",
       "      <td>111</td>\n",
       "      <td>Betacoronavirus</td>\n",
       "      <td>SARS coronavirus B024</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>975</th>\n",
       "      <td>58</td>\n",
       "      <td>117</td>\n",
       "      <td>Epsilonarterivirus</td>\n",
       "      <td>Kigiartevirus</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5090</th>\n",
       "      <td>279</td>\n",
       "      <td>27</td>\n",
       "      <td>Tipravirus</td>\n",
       "      <td>Okavirus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5091</th>\n",
       "      <td>280</td>\n",
       "      <td>72</td>\n",
       "      <td>Bovine torovirus</td>\n",
       "      <td>Torovirus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5092</th>\n",
       "      <td>280</td>\n",
       "      <td>100</td>\n",
       "      <td>Bovine torovirus</td>\n",
       "      <td>Renitovirus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5093</th>\n",
       "      <td>281</td>\n",
       "      <td>158</td>\n",
       "      <td>Abyssoviridae</td>\n",
       "      <td>Abnidovirineae</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5094</th>\n",
       "      <td>282</td>\n",
       "      <td>172</td>\n",
       "      <td>Merbecovirus</td>\n",
       "      <td>Betacoronavirus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>606 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      node1  node2                             virus1                 virus2  \\\n",
       "2670    158    112                     Abnidovirineae      Heroarterivirinae   \n",
       "1427     86    117                       Peiartevirus          Kigiartevirus   \n",
       "2328    139    272  BtKY72/Rhinolophus sp./Kenya/2007            Hibecovirus   \n",
       "2900    172    111                    Betacoronavirus  SARS coronavirus B024   \n",
       "975      58    117                 Epsilonarterivirus          Kigiartevirus   \n",
       "...     ...    ...                                ...                    ...   \n",
       "5090    279     27                         Tipravirus               Okavirus   \n",
       "5091    280     72                   Bovine torovirus              Torovirus   \n",
       "5092    280    100                   Bovine torovirus            Renitovirus   \n",
       "5093    281    158                      Abyssoviridae         Abnidovirineae   \n",
       "5094    282    172                       Merbecovirus        Betacoronavirus   \n",
       "\n",
       "     label  \n",
       "2670     0  \n",
       "1427     0  \n",
       "2328     0  \n",
       "2900     0  \n",
       "975      0  \n",
       "...    ...  \n",
       "5090     1  \n",
       "5091     1  \n",
       "5092     1  \n",
       "5093     1  \n",
       "5094     1  \n",
       "\n",
       "[606 rows x 5 columns]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Call Data Sample\n",
    "\n",
    "df_train_under"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "a73b30b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Path Finding Algorithms - CN,PA,TN\n",
    "\n",
    "def apply_graphy_features(data, rel_type):\n",
    "    query = \"\"\"\n",
    "    UNWIND $pairs AS pair\n",
    "    MATCH (p1) WHERE id(p1) = pair.node1\n",
    "    MATCH (p2) WHERE id(p2) = pair.node2\n",
    "    RETURN pair.node1 AS node1,\n",
    "           pair.node2 AS node2,\n",
    "           gds.alpha.linkprediction.commonNeighbors(p1, p2, {\n",
    "             relationshipQuery: $relType}) AS cn,\n",
    "           gds.alpha.linkprediction.preferentialAttachment(p1, p2, {\n",
    "             relationshipQuery: $relType}) AS pa,\n",
    "           gds.alpha.linkprediction.totalNeighbors(p1, p2, {\n",
    "             relationshipQuery: $relType}) AS tn\n",
    "    \"\"\"\n",
    "    pairs = [{\"node1\": node1, \"node2\": node2}  for node1,node2 in data[[\"node1\", \"node2\"]].values.tolist()]\n",
    "\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.run(query, {\"pairs\": pairs, \"relType\": rel_type})\n",
    "        features = pd.DataFrame([dict(record) for record in result])\n",
    "    return pd.merge(data, features, on = [\"node1\", \"node2\"])\n",
    "\n",
    "df_train_under = apply_graphy_features(df_train_under, \"CHILD_OF\")\n",
    "df_test_under = apply_graphy_features(df_test_under, \"NOT_CHILD_OF\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "88c25d99",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>virus1</th>\n",
       "      <th>virus2</th>\n",
       "      <th>label</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>227</td>\n",
       "      <td>255</td>\n",
       "      <td>Bat SARS coronavirus Rp1</td>\n",
       "      <td>Embecovirus</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>113</th>\n",
       "      <td>172</td>\n",
       "      <td>227</td>\n",
       "      <td>Betacoronavirus</td>\n",
       "      <td>Bat SARS coronavirus Rp1</td>\n",
       "      <td>0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>232</th>\n",
       "      <td>96</td>\n",
       "      <td>21</td>\n",
       "      <td>Monidovirineae</td>\n",
       "      <td>Zealarterivirinae</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>425</th>\n",
       "      <td>113</td>\n",
       "      <td>39</td>\n",
       "      <td>Zetaarterivirus</td>\n",
       "      <td>Simarterivirinae</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>14.0</td>\n",
       "      <td>9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>51</td>\n",
       "      <td>212</td>\n",
       "      <td>Arteriviridae</td>\n",
       "      <td>Muarterivirus</td>\n",
       "      <td>0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>16.0</td>\n",
       "      <td>9.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     node1  node2                    virus1                    virus2 label  \\\n",
       "55     227    255  Bat SARS coronavirus Rp1               Embecovirus     0   \n",
       "113    172    227           Betacoronavirus  Bat SARS coronavirus Rp1     0   \n",
       "232     96     21            Monidovirineae         Zealarterivirinae     0   \n",
       "425    113     39           Zetaarterivirus          Simarterivirinae     1   \n",
       "20      51    212             Arteriviridae             Muarterivirus     0   \n",
       "\n",
       "      cn    pa   tn  \n",
       "55   0.0   7.0  8.0  \n",
       "113  1.0   9.0  9.0  \n",
       "232  0.0   4.0  4.0  \n",
       "425  0.0  14.0  9.0  \n",
       "20   1.0  16.0  9.0  "
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Takes 5 Samples of Trained Data\n",
    "\n",
    "df_train_under.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "348135dd",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Triangle Count Algorithms\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.triangleCount.write({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: 'trianglesTrain'\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.triangleCount.write({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: 'trianglesTest'\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "0522adb2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Local Clustering Coefficient Algorithms\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.localClusteringCoefficient.write({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: 'coefficientTrain'\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.localClusteringCoefficient.write({\n",
    "  nodeProjection: 'Author',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: 'coefficientTest'\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "6a32816c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Minimun and Maximum Value of Triangle Count and Coefficient Clustering Processing\n",
    "\n",
    "def apply_triangles_features(data, triangles_prop, coefficient_prop):\n",
    "    query = \"\"\"\n",
    "    UNWIND $pairs AS pair\n",
    "    MATCH (p1) WHERE id(p1) = pair.node1\n",
    "    MATCH (p2) WHERE id(p2) = pair.node2\n",
    "    RETURN pair.node1 AS node1,\n",
    "    pair.node2 AS node2,\n",
    "    apoc.coll.min([p1[$trianglesProp], p2[$trianglesProp]]) AS minTriangles,\n",
    "    apoc.coll.max([p1[$trianglesProp], p2[$trianglesProp]]) AS maxTriangles,\n",
    "    apoc.coll.min([p1[$coefficientProp], p2[$coefficientProp]]) AS minCoefficient,\n",
    "    apoc.coll.max([p1[$coefficientProp], p2[$coefficientProp]]) AS maxCoefficient\n",
    "    \"\"\"\n",
    "    pairs = [{\"node1\": node1, \"node2\": node2}  for node1,node2 in data[[\"node1\", \"node2\"]].values.tolist()]\n",
    "    params = {\n",
    "    \"pairs\": pairs,\n",
    "    \"trianglesProp\": triangles_prop,\n",
    "    \"coefficientProp\": coefficient_prop\n",
    "    }\n",
    "\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.run(query, params)\n",
    "        features = pd.DataFrame([dict(record) for record in result])\n",
    "\n",
    "    return pd.merge(data, features, on = [\"node1\", \"node2\"])\n",
    "\n",
    "df_train_under = apply_triangles_features(df_train_under, \"trianglesTrain\", \"coefficientTrain\")\n",
    "df_test_under = apply_triangles_features(df_test_under, \"trianglesTest\", \"coefficientTest\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "60f23890",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>virus1</th>\n",
       "      <th>virus2</th>\n",
       "      <th>label</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "      <th>minTriangles</th>\n",
       "      <th>maxTriangles</th>\n",
       "      <th>minCoefficient</th>\n",
       "      <th>maxCoefficient</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>545</th>\n",
       "      <td>227</td>\n",
       "      <td>137</td>\n",
       "      <td>Bat SARS coronavirus Rp1</td>\n",
       "      <td>SARSr-CoV</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>18.0</td>\n",
       "      <td>19.0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.006536</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>497</th>\n",
       "      <td>179</td>\n",
       "      <td>137</td>\n",
       "      <td>RaTG13</td>\n",
       "      <td>SARSr-CoV</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>18.0</td>\n",
       "      <td>19.0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.006536</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>439</th>\n",
       "      <td>125</td>\n",
       "      <td>54</td>\n",
       "      <td>Roniviridae</td>\n",
       "      <td>니도바이러스목</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>44.0</td>\n",
       "      <td>14.0</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0.054545</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>290</th>\n",
       "      <td>210</td>\n",
       "      <td>29</td>\n",
       "      <td>Kadilivirus</td>\n",
       "      <td>Alphamesonivirus 2</td>\n",
       "      <td>0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>353</th>\n",
       "      <td>45</td>\n",
       "      <td>183</td>\n",
       "      <td>Alphamononivirus</td>\n",
       "      <td>Mononivirinae</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     node1  node2                    virus1              virus2 label   cn  \\\n",
       "545    227    137  Bat SARS coronavirus Rp1           SARSr-CoV     1  0.0   \n",
       "497    179    137                    RaTG13           SARSr-CoV     1  0.0   \n",
       "439    125     54               Roniviridae             니도바이러스목     1  1.0   \n",
       "290    210     29               Kadilivirus  Alphamesonivirus 2     0  1.0   \n",
       "353     45    183          Alphamononivirus       Mononivirinae     1  0.0   \n",
       "\n",
       "       pa    tn  minTriangles  maxTriangles  minCoefficient  maxCoefficient  \n",
       "545  18.0  19.0             0             1        0.000000        0.006536  \n",
       "497  18.0  19.0             0             1        0.000000        0.006536  \n",
       "439  44.0  14.0             2             3        0.054545        0.333333  \n",
       "290   4.0   3.0             0             1        0.000000        1.000000  \n",
       "353   4.0   4.0             0             0        0.000000        0.000000  "
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_train_under.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "6d797338",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Community Detection - Label Propagation\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.labelPropagation.write({\n",
    "  nodeProjection: \"Virus\",\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: \"partitionTrain\"\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.labelPropagation.write({\n",
    "  nodeProjection: \"Virus\",\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  writeProperty: \"partitionTest\"\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "8ad3ed42",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'properties_set': 277}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": [
       "{'properties_set': 277}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Community Detection - louvain\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.louvain.stream({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  includeIntermediateCommunities: true\n",
    "})\n",
    "YIELD nodeId, communityId, intermediateCommunityIds\n",
    "WITH gds.util.asNode(nodeId) AS node, intermediateCommunityIds[0] AS smallestCommunity\n",
    "SET node.louvainTrain = smallestCommunity;\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    display(session.run(query).consume().counters)\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.louvain.stream({\n",
    "  nodeProjection: 'Virus',\n",
    "  relationshipProjection: {\n",
    "    CHILD_OF: {\n",
    "      type: 'CHILD_OF',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  },\n",
    "  includeIntermediateCommunities: true\n",
    "})\n",
    "YIELD nodeId, communityId, intermediateCommunityIds\n",
    "WITH gds.util.asNode(nodeId) AS node, intermediateCommunityIds[0] AS smallestCommunity\n",
    "SET node.louvainTest = smallestCommunity;\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    display(session.run(query).consume().counters)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "9cb1a973",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Community Detection - Same Community\n",
    "\n",
    "def apply_community_features(data, partition_prop, louvain_prop):\n",
    "    query = \"\"\"\n",
    "    UNWIND $pairs AS pair\n",
    "    MATCH (p1) WHERE id(p1) = pair.node1\n",
    "    MATCH (p2) WHERE id(p2) = pair.node2\n",
    "    RETURN pair.node1 AS node1,\n",
    "    pair.node2 AS node2,\n",
    "    gds.alpha.linkprediction.sameCommunity(p1, p2, $partitionProp) AS sp,\n",
    "    gds.alpha.linkprediction.sameCommunity(p1, p2, $louvainProp) AS sl\n",
    "    \"\"\"\n",
    "    pairs = [{\"node1\": node1, \"node2\": node2}  for node1,node2 in data[[\"node1\", \"node2\"]].values.tolist()]\n",
    "    params = {\n",
    "    \"pairs\": pairs,\n",
    "    \"partitionProp\": partition_prop,\n",
    "    \"louvainProp\": louvain_prop\n",
    "    }\n",
    "\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.run(query, params)\n",
    "        features = pd.DataFrame([dict(record) for record in result])\n",
    "\n",
    "    return pd.merge(data, features, on = [\"node1\", \"node2\"])\n",
    "\n",
    "df_train_under = apply_community_features(df_train_under, \"partitionTrain\", \"louvainTrain\")\n",
    "df_test_under = apply_community_features(df_test_under, \"partitionTest\", \"louvainTest\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "a039a15e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>virus1</th>\n",
       "      <th>virus2</th>\n",
       "      <th>label</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "      <th>minTriangles</th>\n",
       "      <th>maxTriangles</th>\n",
       "      <th>minCoefficient</th>\n",
       "      <th>maxCoefficient</th>\n",
       "      <th>sp</th>\n",
       "      <th>sl</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>250</td>\n",
       "      <td>57</td>\n",
       "      <td>Orthocoronavirinae</td>\n",
       "      <td>FalCoV UAE-HKU27</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>114</td>\n",
       "      <td>27</td>\n",
       "      <td>Mesoniviridae</td>\n",
       "      <td>Okavirus</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>64</td>\n",
       "      <td>21</td>\n",
       "      <td>Tornidovirineae</td>\n",
       "      <td>Zealarterivirinae</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>170</td>\n",
       "      <td>250</td>\n",
       "      <td>SARS-CoV-1</td>\n",
       "      <td>Orthocoronavirinae</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>36</td>\n",
       "      <td>62</td>\n",
       "      <td>Variarterivirinae</td>\n",
       "      <td>Betaarterivirus suid 1</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   node1  node2              virus1                  virus2 label   cn   pa  \\\n",
       "0    250     57  Orthocoronavirinae        FalCoV UAE-HKU27     0  0.0  0.0   \n",
       "1    114     27       Mesoniviridae                Okavirus     0  0.0  0.0   \n",
       "2     64     21     Tornidovirineae       Zealarterivirinae     0  0.0  0.0   \n",
       "3    170    250          SARS-CoV-1      Orthocoronavirinae     0  0.0  0.0   \n",
       "4     36     62   Variarterivirinae  Betaarterivirus suid 1     0  0.0  0.0   \n",
       "\n",
       "    tn  minTriangles  maxTriangles minCoefficient maxCoefficient   sp   sl  \n",
       "0  0.0             0             0           None           None  0.0  0.0  \n",
       "1  0.0             2             2           None           None  0.0  0.0  \n",
       "2  0.0             0             0           None           None  1.0  0.0  \n",
       "3  0.0             0             0           None           None  0.0  0.0  \n",
       "4  0.0             0             0           None           None  0.0  0.0  "
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_test_under.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "bc843b80",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>virus1</th>\n",
       "      <th>virus2</th>\n",
       "      <th>label</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "      <th>minTriangles</th>\n",
       "      <th>maxTriangles</th>\n",
       "      <th>minCoefficient</th>\n",
       "      <th>maxCoefficient</th>\n",
       "      <th>sp</th>\n",
       "      <th>sl</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>158</td>\n",
       "      <td>112</td>\n",
       "      <td>Abnidovirineae</td>\n",
       "      <td>Heroarterivirinae</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>86</td>\n",
       "      <td>117</td>\n",
       "      <td>Peiartevirus</td>\n",
       "      <td>Kigiartevirus</td>\n",
       "      <td>0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>139</td>\n",
       "      <td>272</td>\n",
       "      <td>BtKY72/Rhinolophus sp./Kenya/2007</td>\n",
       "      <td>Hibecovirus</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>172</td>\n",
       "      <td>111</td>\n",
       "      <td>Betacoronavirus</td>\n",
       "      <td>SARS coronavirus B024</td>\n",
       "      <td>0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.083333</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>58</td>\n",
       "      <td>117</td>\n",
       "      <td>Epsilonarterivirus</td>\n",
       "      <td>Kigiartevirus</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   node1  node2                             virus1                 virus2  \\\n",
       "0    158    112                     Abnidovirineae      Heroarterivirinae   \n",
       "1     86    117                       Peiartevirus          Kigiartevirus   \n",
       "2    139    272  BtKY72/Rhinolophus sp./Kenya/2007            Hibecovirus   \n",
       "3    172    111                    Betacoronavirus  SARS coronavirus B024   \n",
       "4     58    117                 Epsilonarterivirus          Kigiartevirus   \n",
       "\n",
       "  label   cn   pa   tn  minTriangles  maxTriangles  minCoefficient  \\\n",
       "0     0  0.0  4.0  4.0             0             0             0.0   \n",
       "1     0  1.0  4.0  3.0             0             0             0.0   \n",
       "2     0  0.0  2.0  3.0             0             0             0.0   \n",
       "3     0  1.0  9.0  9.0             0             3             0.0   \n",
       "4     0  0.0  4.0  4.0             0             0             0.0   \n",
       "\n",
       "   maxCoefficient   sp   sl  \n",
       "0        0.000000  1.0  0.0  \n",
       "1        0.000000  1.0  0.0  \n",
       "2        0.000000  1.0  0.0  \n",
       "3        0.083333  1.0  0.0  \n",
       "4        0.000000  1.0  0.0  "
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_train_under.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "fddcac75",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fold:1, Train set: 484, Test set:122\n",
      "Fold:2, Train set: 485, Test set:121\n",
      "Fold:3, Train set: 485, Test set:121\n",
      "Fold:4, Train set: 485, Test set:121\n",
      "Fold:5, Train set: 485, Test set:121\n",
      "CPU times: total: 0 ns\n",
      "Wall time: 2 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "from sklearn.model_selection import KFold, StratifiedKFold, cross_val_score\n",
    "from sklearn import linear_model, tree, ensemble\n",
    "\n",
    "columns = [\n",
    "        \"cn\", \"pa\", \"tn\", # graph features\n",
    "        \"minTriangles\", \"maxTriangles\", \"minCoefficient\", \"maxCoefficient\", # triangle features\n",
    "        \"sp\", \"sl\" # community features\n",
    "    ]\n",
    "\n",
    "X = df_train_under[columns]\n",
    "y = df_train_under[\"label\"]\n",
    "\n",
    "kf =KFold(n_splits=5, shuffle=True, random_state=42)\n",
    "\n",
    "cnt = 1\n",
    "for train_index, test_index in kf.split(X, y):\n",
    "    print(f'Fold:{cnt}, Train set: {len(train_index)}, Test set:{len(test_index)}')\n",
    "    cnt += 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "c1abe6c9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Scores for each fold are: [0.90983607 0.90082645 0.88429752 0.90082645 0.90909091]\n",
      "CPU times: total: 688 ms\n",
      "Wall time: 696 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "def rmse(score):\n",
    "    rmse = np.sqrt(-score)\n",
    "    print(f'rmse= {\"{:.2f}\".format(rmse)}')\n",
    "\n",
    "score = cross_val_score(ensemble.RandomForestClassifier(random_state= 42), X, y, cv= kf, scoring=\"accuracy\")\n",
    "print(f'Scores for each fold are: {score}')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "5d2ba008",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Complete !\n"
     ]
    }
   ],
   "source": [
    "print('Complete !')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
